{
	"experience": [
		{
			"company": "IT Academy",
			"title": "Software Development Student",
			"description": "Completed Software Development/ MTA Fundamentals Course.",
			"date": "March 2022 - March 2023",
			"url": "https://itacademy.co.za/"
		},
		{
			"company": "Life Choices Academy",
			"title": "Fullstack Web Development Student / Assistant Coding Lecturer",
			"description": "At Life Choices Academy, I supported aspiring coders through private tutoring sessions and group workshops, offering guidance, troubleshooting assistance, and practical tips to help them grow their technical skills.\n\nI also took on a team lead role in development projects, creating hands-on learning opportunities that bridged theory with real-world coding practices.",
			"date": "September 2022 - June 2023",
			"url": "https://lifechoicesacademy.com/"
		},
		{
			"company": "IMQS Software",
			"title": "Intern Software Developer",
			"description": "At IMQS Software, I contributed as part of an agile development team, actively participating in daily standups and project planning sessions. I worked with client project data using Rapid Application Development (RAD) methodologies and leveraged PostgreSQL for efficient data storage and retrieval.\n\nMy role included developing new features to enhance developer tools and streamline User Acceptance Testing (UAT), using Golang for backend development and TypeScript with Vue.js for the frontend.\n\nI also gained experience with CI/CD pipelines, Docker, GitHub, and Ubuntu Linux, while completing TypeScript onboarding to align with company coding standards and best practices.",
			"date": "July 2023 - July 2024",
			"url": "https://www.imqs.co.za/"
		},
		{
			"company": "QTZ Concrete",
			"title": "Web Developer",
			"description": "At QTZ Concrete, I worked as part of the IT team to support daily operations by building custom programs that streamlined internal processes. I collaborated with the marketing team to create a tool that simplified the design and generation of business flyers, product specifications, and letters, using JavaScript, Python, and Figma.\n\nIn addition, I developed and enhanced company websites with WordPress and PHP, ensuring they were functional, up to date, and aligned with business needs.",
			"date": "August 2024 - December 2024",
			"url": "https://qtzconcrete.co.za/"
		},
		{
			"company": "Zaio",
			"title": "Fullstack Web Development Student",
			"description": "Completed a Fullstack Web Development Coding Bootcamp, earning an NQF 5 Higher Certificate.\n\nGained hands-on experience through live training, real-world projects, and practical interview preparation.",
			"date": "October 2024 - May 2025",
			"url": "https://www.zaio.io/"
		},
		{
			"company": "Flash Components CC",
			"title": "Web Developer",
			"description": "At Flash Components, I design and develop responsive websites using WordPress, ensuring they are visually appealing, functional, and user-friendly. I handle regular updates and maintenance to keep sites secure and up to date, while also creating, uploading, and scheduling daily content to keep them fresh and engaging.\n\nMy role includes optimizing websites for search engines through on-page SEO best practices and monitoring performance with tools like Google Analytics to identify opportunities for improvement and guide SEO strategies.",
			"date": "December 2024 - Present",
			"url": "https://flash.za.com/"
		}
	],
	"projects": [
		{
			"code": "https://github.com/MeezaanD/cash-flow",
			"liveLink": "https://cash-flow-ebon.vercel.app/",
			"description": "A personal finance tracker app that helps users manage, log, and track their transactions with real-time updates and secure authentication via Firebase.",
			"title": "Cash Flow",
			"techStack": "React · Typescript · Firebase",
			"type": "personal"
		}
	]
}